app/views/users/index.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 7]]
---
    <% @users.each do |user| %>
    <% @myrole = Role.find user.role_id unless user.role_id.nil?  %>