app/controllers/shifts_controller.rb

  def create
    @shift = Shift.new(shift_params)

    respond_to do |format|
      if @shift.save
---
INSERT INTO "shifts" ("date", "startTime", "endTime") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2015-05-06"], ["startTime", "2015-05-06 08:28:00.000000"], ["endTime", "2015-05-06 08:28:00.000000"]]